Revit 2024 API
PipeFittingAndAccessoryPressureDropUIData.GetUnits Method
 Gets units.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Units GetUnits()
Visual Basic
Public Function GetUnits As Units
Visual C++
public:
Units^ GetUnits()
Return Value
 The Units object.
See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace